code-review/NRB_3471_3546/База_Было/InformationRegisters/ЭмитентыЗапрещенныеДляНедружественныхНерезидентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЭмитентыЗапрещенныеДляНедружественныхНерезидентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ЭмитентыЗапрещенныеДляНедружественныхНерезидентов/Ext/ManagerModule.bsl
// Функция - Эмитент является запрещенным
//
// Параметры:
//  Контрагент	 - СправочникСсылка.Контрагенты - Контрагент которого требуется проверить
//  Дата		 - Дата - Дата на которую идет проверка
// 
// Возвращаемое значение:
//   -Булево
//
Функция ЭмитентЯвляетсяЗапрещенным(Контрагент, Дата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭмитентыЗапрещенныеДляНедружественныхНерезидентов.Эмитент КАК Эмитент
	|ИЗ
	|	РегистрСведений.ЭмитентыЗапрещенныеДляНедружественныхНерезидентов КАК ЭмитентыЗапрещенныеДляНедружественныхНерезидентов
	|ГДЕ
	|	ЭмитентыЗапрещенныеДляНедружественныхНерезидентов.ДатаНачалаДействия <= &Дата
	|	И ЭмитентыЗапрещенныеДляНедружественныхНерезидентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|	И (ЭмитентыЗапрещенныеДляНедружественныхНерезидентов.ДатаОкончанияДействия >= &Дата
	|			ИЛИ ЭмитентыЗапрещенныеДляНедружественныхНерезидентов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
	|	И ЭмитентыЗапрещенныеДляНедружественныхНерезидентов.Эмитент В(&Контрагент)";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;


КонецФункции
